Revit 2027 API
IConnector.Shape Property
The shape of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
ConnectorProfileType Shape { get; }
ReadOnly Property Shape As ConnectorProfileType
	Get
property ConnectorProfileType Shape {
	ConnectorProfileType get ();
}
abstract Shape : ConnectorProfileType with get
Property Value
ConnectorProfileType
Exceptions
Exception | Condition
InvalidOperationException |  Throw when this connector has no shape.
Remarks
This property is used to retrieve the shape of the connector.
See Also
Reference
IConnector Interface
Autodesk.Revit.DB Namespace